/*
[문제]
머쓱이네 피자가게는 피자를 여섯 조각으로 잘라 줍니다. 
피자를 나눠먹을 사람의 수 n이 매개변수로 주어질 때, n명이 주문한 피자를 남기지 않고 모두 같은 수의 
피자 조각을 먹어야 한다면 최소 몇 판을 시켜야 하는지를 return 하도록 solution 함수를 완성해보세요.

[제한사항]
- 1 ≤ n ≤ 100

[입출력]
|    n   | result |
|--------|--------|
|    6   |    1   |
|   10   |    5   |
|    4   |    2   |
*/

function solution(n) {
  // 피자 최소 1판 부터 시작
  let pizza = 1;

  // 무한 반복문.
  // 피자 한판당 조각 6개 * 피자판 수를 전체 인원으로 나눴을 때 나머지가 0이라면 반복문 종료
  while (true) {
    if ((6 * pizza) % n === 0) {
      break;
    }
    pizza++;
  }

  // 최종 주문해야하는 피자판 수 리턴
  return pizza;
}
